{"ro": {"0": {"statement": "Ce afirmații sunt adevărate despre obiecte:", "correct": [0, 1, 2, 3, 4], "answers": [{"id": "0", "answer": "Folosite ca parametri ai funcțiilor, ne permit să le modificăm valorile și să transmitem aceste modificări inapoi clienților funcției"}, {"id": "1", "answer": "Sunt colecții de proprietăți de tip șir de caracter"}, {"id": "2", "answer": "Se definesc prin utilizarea acoladelor"}, {"id": "3", "answer": "Sunt colecții de proprietăți ale căror valori pot fi de orice tip"}, {"id": "4", "answer": "Se pot crea folosind funcții constructor"}], "explanation": "Obiectele sunt variabile ce pot stoca colecții de proprietăți și valorile asociate lor. Proprietățile pot fi doar de tip șir de caractere pe când valorile aferente lor, de orice tip. Aceste obiecte se crează folosind acoladele sau funcțiile constructor. Atunci când obiectele sunt trimise că parametri funcțiilor, în corpul funcției se pot modifica valorile proprietăților și astfel transmite aceste modificări înapoi către clienții funcției."}, "1": {"statement": "Accesarea proprietății <code>prop</code> a unei variabile <code>obj</code> de tip obiect se face folosind sintaxa:", "correct": [2, 3], "answers": [{"id": "0", "answer": "<pre><code>obj(prop)</pre></code>"}, {"id": "1", "answer": "<pre><code>obj[prop]</pre></code>"}, {"id": "2", "answer": "<pre><code>obj.prop</pre></code>"}, {"id": "3", "answer": "<pre><code>obj['prop']</pre></code>"}], "explanation": "Proprietățile unui obiect sunt doar de tip șir de caractere de aceea trebuie să le specificăm folosind apostrof ('). Cealaltă sintaxa validă este <strong>obj.prop</strong>."}, "2": {"statement": "Copierea unui obiect în alt obiect duce la:", "correct": [1], "answers": [{"id": "0", "answer": "Duplicarea proprietăților obiectului sursă în cel destinație"}, {"id": "1", "answer": "Crearea unei referințe de la obiectul destinație la cel sursă"}, {"id": "2", "answer": "Copierea tuturor proprietăților obiectului sursă în cel destinație și golirea celui din urmă"}], "explanation": "Operația de atribuire a unui obiect altui obiect va duce la creare unei referințe adică a unei variabile cu nume nou dar care referă obiectul sursă ce i-a fost atribuit."}, "3": {"statement": "Care din operațiile de mai jos efectuate în corpul unei funcții pe un parametru de tip obiect sunt adevărate:", "correct": [0, 1, 2], "answers": [{"id": "0", "answer": "Orice modificare adusă unei proprietăți a obiectului este transmisă înapoi către clienți"}, {"id": "1", "answer": "I se pot adaugă/șterge proprietăți"}, {"id": "2", "answer": "Se poate crea un obiect nou"}, {"id": "3", "answer": "Se poate folosi ca parametru de ieșire"}]}}, "src-ro": "obiecte.ro.quiz"}